[
  {
    "url": "http://numen.nu.edu.pk/Login",
    "content": [
      {
        "type": "section",
        "heading": "Why am I seeing this page?",
        "content": [
          "Here are some common issues that cause you to see this page:"
        ],
        "lists": [],
        "tables": []
      }
    ]
  },
  {
    "url": "http://pwr.nu.edu.pk/",
    "content": [
      {
        "type": "section",
        "heading": "Experienced Faculty",
        "content": [
          "Most of faculty at FAST PWR are PhD holders achieving their doctorate from well known universities. They are professionals who have the ability to develop relationships with their students, engages them in learning and are committed to the success of their students.",
          "FAST specializes in providing modern and updated course content that is based on latest technology and innovations. Major focus of the course is not to learn theory but to implement it in real life applications. Simply putting it, if quality education is an art then FAST is Picasso of it.",
          "Here at FAST we have labs equipped with latest tech which enables students to learn on any platform. The lab management maintains every system and the internet service is available 24/7."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "WELCOME TO FAST-NUCES PESHAWAR",
        "content": [
          "FAST-NUCES",
          "The National University of Computer & Emerging Sciences has the honor of being the first multi-campus private sector university set up under the Federal Charter granted by the Ordinance No. XXIII of 2000, dated July 01, 2000.",
          "It is housed in a purposed built impressive building, which has an architectural design similar of the Lahore and Karachi campus. The green, well maintained lawns that surround the building add to the scenic beauty of the whole setup. The Campus covers an area of 4 acres and is located in the Industrial Estate, Hayatabad."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "LATEST FROM CAMPUS",
        "content": [
          "CAMPUS",
          "Congratulation Mr. Suleman Mir on successfully defending his PhD thesis titled: \"Spectrum ..",
          "Dec 10, 21",
          "On 14 October 2021, IEEE FAST NUCES Peshawar Student Branch celebrated IEEE Day 2021. IEE..",
          "Oct 14, 21",
          "The Punjab Chief Minister Honhaar Scholarship Program is now available for newly enrolled ..",
          "Oct 03, 24",
          "The public defence of Mr. Abdul Shakeel under the supervision of Dr. Hamid Khan was held i..",
          "Nov 12, 21",
          "Mr. Rafaeel Akbar Chaudhry, President FAST-NU Alumni Association, North America - FAANA an..",
          "Dec 01, 21",
          "Congratulation Mr. Asad Khan on successfully defending his PhD thesis titled: “Detection..",
          "Dec 03, 21",
          "Congratulation Mr. Suleman Mir on successfully defending his PhD thesis titled: \"Spectrum ..",
          "Dec 10, 21",
          "On 14 October 2021, IEEE FAST NUCES Peshawar Student Branch celebrated IEEE Day 2021. IEE..",
          "Oct 14, 21",
          "The Punjab Chief Minister Honhaar Scholarship Program is now available for newly enrolled ..",
          "Oct 03, 24",
          "The public defence of Mr. Abdul Shakeel under the supervision of Dr. Hamid Khan was held i..",
          "Nov 12, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "Congratulation Mr. Suleman Mir on successfully defending his PhD thesis titled: \"Spectrum ..",
          "Dec 10, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "On 14 October 2021, IEEE FAST NUCES Peshawar Student Branch celebrated IEEE Day 2021. IEE..",
          "Oct 14, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "The Punjab Chief Minister Honhaar Scholarship Program is now available for newly enrolled ..",
          "Oct 03, 24"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "The public defence of Mr. Abdul Shakeel under the supervision of Dr. Hamid Khan was held i..",
          "Nov 12, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "Mr. Rafaeel Akbar Chaudhry, President FAST-NU Alumni Association, North America - FAANA an..",
          "Dec 01, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "Congratulation Mr. Asad Khan on successfully defending his PhD thesis titled: “Detection..",
          "Dec 03, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "Congratulation Mr. Suleman Mir on successfully defending his PhD thesis titled: \"Spectrum ..",
          "Dec 10, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "On 14 October 2021, IEEE FAST NUCES Peshawar Student Branch celebrated IEEE Day 2021. IEE..",
          "Oct 14, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "The Punjab Chief Minister Honhaar Scholarship Program is now available for newly enrolled ..",
          "Oct 03, 24"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "",
        "content": [
          "The public defence of Mr. Abdul Shakeel under the supervision of Dr. Hamid Khan was held i..",
          "Nov 12, 21"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "UPCOMING EVENTS",
        "content": [
          "EVENTS",
          "Its time to reveal the Post..",
          "From a very rich variety of..",
          "Your pitch is the single th..",
          "FAST NUCES Peshawar Campus ..",
          "FAST-NUCES?",
          "Founded as a Federally Chartered University in July 2000, the National University of Computer and Emerging Sciences is a premiere University of Pakistan, renowned for quality and impact of its students in the development of local software and other industries. The university has five modern campuses at Karachi, Lahore, Islamabad, Peshawar and Chiniot-Faisalabad. These campuses provide world class educational environment and recreational facilities to about over 11,000 students, around one quarter are female and over 500 skilled faculty members.",
          "Research wings of the university are well recognized, nationally and internationally. They are embarked upon cutting edge research having direct impact on the social, economic and technological needs of Pakistan. Our vision is to become a globally recognized research university of Pakistan within the next decade."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "FAST league ‘20",
        "content": [
          "Its time to reveal the Post.."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "Virtual Competition Microfest++",
        "content": [
          "From a very rich variety of.."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "Business Idea",
        "content": [
          "Your pitch is the single th.."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "article",
        "heading": "Digital Hackathon",
        "content": [
          "FAST NUCES Peshawar Campus .."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "OFFERED PROGRAMS",
        "content": [
          "PROGRAMS",
          "MS",
          "This program prepares a graduate in Electrical Engineering to acquire expertise in a..",
          "PHD",
          "The PhD program requires candidates to undertake a number of graduate level..",
          "PHD",
          "The PhD program requires candidates to undertake a number of graduate level..",
          "BS",
          "Impart in-depth understanding of Computer Science field according to international standards.",
          "BS",
          "The mission of School of Electrical Engineering is to provide graduates with a strong and..",
          "MS",
          "This program equips students to transform data into actionable insights that enable one to make..",
          "MS",
          "The MS (Computer Science) comprises of both course work as well as research component.",
          "MS",
          "This program prepares a graduate in Electrical Engineering to acquire expertise in a..",
          "PHD",
          "The PhD program requires candidates to undertake a number of graduate level..",
          "PHD",
          "The PhD program requires candidates to undertake a number of graduate level..",
          "BS",
          "Impart in-depth understanding of Computer Science field according to international standards.",
          "BS",
          "The mission of School of Electrical Engineering is to provide graduates with a strong and..",
          "MS",
          "This program equips students to transform data into actionable insights that enable one to make.."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "CAMPUS LIFE",
        "content": [
          "LIFE"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "Our Alumni Success Stories",
        "content": [
          "I am Flying Officer Qazi Muhammad Shakir Ullah. Graduated in 2017 from the FAST-NU Peshawar campus with a degree in Electrical Engineering.",
          "After graduating I worked in a private company based in NUST for a year. While working there I applied in the graduate course of Pakistan Air Force and went through a strenuous and tough screening process including ISSB, detailed medical, and a final interview with a panel of highly experienced officials. Finally, after almost 8 months of tests and evaluations, I got selected in the Engineering Branch of Pakistan Air Force as a commissioned officer. I am currently posted in Pakistan Aeronautical Complex, Kamrah, and looking over the communications field.",
          "To my juniors: \"I lost 38kgs in a span of approximately 1 year before joining PAF. So nothing is impossible if you're dedicated and committed to your goal. Also, respect your parents and your teachers since they're the ones who selflessly wish the best for you. “Good luck!",
          "Become a part FAST Family, and gain a transformative experience with minimum disruption to your career. Apply now!",
          "Apply: http://admissions.nu.edu.pk/OLAR/",
          "FAST NUCES, Peshawar Campus Alumni, Asad Ullah Khan (Batch 16 - EE). Currently working as a Financial Consultant at SilkBank Islamic Branch. His message for FASTians: \"I want to start by sharing the lesson I learned from what I experienced on my journey from the days as a student to where I am right now. “Never be dishearten or lose hope in what's happening at the moment. Think about what you can do to improve your future\" these words might seem boring but trust me they really kept me going. Somewhere in between my university term, I started to repent my decision about studying engineering. My family was business-oriented so my interest started developing towards it. I graduated in 2020 as an Electrical Engineer and started working for a solar company as an intern but my interest and passion towards business remained and this motivated me to take the leap from engineering to business and I applied for banking positions because what better way to learn business than through banking. And Alhumdullilah I got selected and I'm currently working for SilkBank Islamic Branch. Studying Engineering doesn't mean you're bound to work in the engineering field only. There are endless opportunities for young graduates. This thinking is what led to where I am right now and this is just a start. I urge you all to keep working hard and have faith. Look out for all the opportunities and with all the skills you can get hired in no time. \"",
          "FAST NUCES, Peshawar Campus Alumni, Saifullah Khan Durrani. Currently, working in @careem as a Training and deployment coordinator. His message for FASTians: \"It is our inbuilt desire to be successful and to proceed forward consistently. Consistency in work is what really is important. The mentality of competing with each other can frequently be noticed at any stage of life and it's important to be steadfast during this time. I started working towards my future during the graduation period by being active in societies as I was the media head of IEEE and WIE. I worked in PC Bhurban and PC Muzzafarabad's Engineering Department, and Heavy Electrical Complex (HEC) as an intern. This has helped me a lot in my practical life and groomed me to be more responsible and disciplined with good leadership qualities.\"",
          "Meet Muhammad graduated from FAST-NU Peshawar Campus in 2009. Currently, He is working as a Senior IT Auditor, KPMG Dublin, Ireland. Previously he worked for Deloitte Islamabad as an Assistant Manager IT Audit. Admissions for FALL 2020 are open! To apply please follow the link: http://pwr.nu.edu.pk/admissions/ Last date to apply: 30th July 2020",
          "Hi, I am Farwa Zaki. CS graduate of Batch 12. Currently, I am working as a Data Analyst in Telenor Pakistan. My message for @FASTians is, \"The best way to predict the future is to create it.\" **Announcement: Pre-Medical Students are eligible to apply for computing programs** FAST NUCES HAS WAIVED OFF APPLICATION FEE DUE TO COVID19. SO WHAT ARE YOU WAITING FOR.. APPLY NOW: http://pwr.nu.edu.pk/admissions/ For further details email at admission.pwr@nu.edu,pk or contact on our phone numbers that our operators are available 24/7; (+92) 334 112 8128, (+92) 335 112 8128, (+92) 336 112 8128",
          "Mustafa Toufiq, Batch 15 graduate of the Computer Science Department. He Worked in the directorate of IT for 6 months then he gains experience at VeevoTech (an IT Company) in 2017. Now he is working in the IT Department of Allied Bank Head Office Lahore as Sr.Officer Data Architect & Integration since December 2019 His Experience at Peshawar Campus: \"The journey I have made in FAST, Peshawar Campus is something I will never forget. Many of our proudest moments, our greatest achievements and our lasting memories are drawn from our University days. Meeting lifelong friends to walking across the stage at Graduation. I've learned soo many new skills and technologies in Peshawar Campus that is now helping me in practical life. I will always be thankful to my teachers especially my supervisor who always believed in me & motivated me.\" His Message for Current Students: \"There's nothing you can't achieve just believe in yourself, dream big, work hard, stay focused and surround yourself with good people\" APPLY NOW: http://pwr.nu.edu.pk/admissions/ For further details email at admission.pwr@nu.edu,pk or contact on our phone numbers that our operators are available 24/7; (+92) 334 112 8128, (+92) 335 112 8128, (+92) 336 112 8128",
          "Rahila Syed Batch 12, Computer Science. Currently, she is working as Microsoft Dynamics 365 Business Central & Microsoft Dynamics NAV Technical Consultant at Synergy-IT Pakistan. Her Message for the students is \"There are no secrets to success. It is the result of preparation, hard work, and learning from failure.\" APPLY NOW: http://pwr.nu.edu.pk/admissions/ For further details email at admission.pwr@nu.edu,pk or contact on our phone numbers that our operators are available 24/7; (+92) 334 112 8128, (+92) 335 112 8128, (+92) 336 112 8128",
          "Kaleem Nawaz Khan received BS, M.S degrees all with distinctions in computer science from Peshawar Campus in 2015 and in 2018, respectively. In his BS, he was a scholar of PM’s National ICT Scholarship Program 2011- 2015. He was serving as Instructor/RO within the Department of Computer Science, Peshawar Campus from July 2015- March 2019. Since March-2019 he is a Project Lead within Artificial Intelligence in Healthcare, National Center of Artificial Intelligence (NCAI), University of Engineering and Technology (UET), Peshawar, Pakistan. He is leading different projects within Artificial Intelligence in the healthcare branch of NCAI, Peshawar. Some of the projects are; deep learning-based Phonocardiogram signals (heart sound) classification and cardiovascular disease diagnosis, deep learning methods for liver and liver tumor segmentation and classification on real data, deep learning-based thalassemia screening using electrophoresis test images. “My memories of FAST are of learning, polishing skills, and developing a network of a few awesome friends. I have spent a golden 8 years of my life at FAST Peshawar, both as a student as well as a teacher. My time at FAST Peshawar really matured me as a person and helped me to develop my personality. Attending FAST helped me in terms of confidence as well as the depth of knowledge. Thank you FAST for everything! A short message for all the youngsters at FAST, \"Working hard is important. But there is something that matters even more: believing in yourself.”",
          "I am Flying Officer Qazi Muhammad Shakir Ullah. Graduated in 2017 from the FAST-NU Peshawar campus with a degree in Electrical Engineering.",
          "After graduating I worked in a private company based in NUST for a year. While working there I applied in the graduate course of Pakistan Air Force and went through a strenuous and tough screening process including ISSB, detailed medical, and a final interview with a panel of highly experienced officials. Finally, after almost 8 months of tests and evaluations, I got selected in the Engineering Branch of Pakistan Air Force as a commissioned officer. I am currently posted in Pakistan Aeronautical Complex, Kamrah, and looking over the communications field.",
          "To my juniors: \"I lost 38kgs in a span of approximately 1 year before joining PAF. So nothing is impossible if you're dedicated and committed to your goal. Also, respect your parents and your teachers since they're the ones who selflessly wish the best for you. “Good luck!",
          "Become a part FAST Family, and gain a transformative experience with minimum disruption to your career. Apply now!",
          "Apply: http://admissions.nu.edu.pk/OLAR/",
          "FAST NUCES, Peshawar Campus Alumni, Asad Ullah Khan (Batch 16 - EE). Currently working as a Financial Consultant at SilkBank Islamic Branch. His message for FASTians: \"I want to start by sharing the lesson I learned from what I experienced on my journey from the days as a student to where I am right now. “Never be dishearten or lose hope in what's happening at the moment. Think about what you can do to improve your future\" these words might seem boring but trust me they really kept me going. Somewhere in between my university term, I started to repent my decision about studying engineering. My family was business-oriented so my interest started developing towards it. I graduated in 2020 as an Electrical Engineer and started working for a solar company as an intern but my interest and passion towards business remained and this motivated me to take the leap from engineering to business and I applied for banking positions because what better way to learn business than through banking. And Alhumdullilah I got selected and I'm currently working for SilkBank Islamic Branch. Studying Engineering doesn't mean you're bound to work in the engineering field only. There are endless opportunities for young graduates. This thinking is what led to where I am right now and this is just a start. I urge you all to keep working hard and have faith. Look out for all the opportunities and with all the skills you can get hired in no time. \""
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "CAMPUS SOCIETIES",
        "content": [
          "SOCIETIES"
        ],
        "lists": [],
        "tables": []
      }
    ]
  },
  {
    "url": "http://cfd.nu.edu.pk/",
    "content": [
      {
        "type": "section",
        "heading": "University Life that you dream of!",
        "content": [
          "Welcome to the world filled with opportunities and fun!",
          "Welcome to the world of books!",
          "Separate hostel accommodation is available for both male and female students."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "University Life that you dream of!",
        "content": [
          "Welcome to the world filled with opportunities and fun!"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "Our Library, the atlas of knowledge.",
        "content": [
          "Welcome to the world of books!"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "Hostel Accommodation within University",
        "content": [
          "Separate hostel accommodation is available for both male and female students."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "DIRECTOR'S MESSAGE",
        "content": [
          "Dr. Muhammad Shahzad Sarfraz",
          "FAST National University of Computer and Emerging Sciences is a leading Science and Technology University of the country accelerating with emerging technologies and producing human resources of highest acumen. Our Alumni are serving global and international organizations for years and contributing in forms of startups as well. The university successfully accomplishes its sole aim of extending latest knowledge to its students compatible to the need of the hour. Students belonging to various ethnic, religious, social and economic backgrounds find a level playing field to enhance their capabilities and professional skills at the university. We believe in the overall persona of our students which is enriched by extra and co-curricular activities. Our students are keen to take challenges and love problem solving in its core. Our highly qualified and research-oriented faculty foster in students an urge to develop inquisitive spirit of innovation and dynamism. In terms of infrastructure the university is second to none. It’s a complete experience from its well-equipped labs to state of the art classrooms, from lush green playgrounds to highly conducive environment for learning and development. The environment is designed to inculcate a value system that is for responsible human beings and efficient professionals. We are committed to opening up new avenues for our students so that they can handle the daunting tasks of continuously changing fields of innovation, science and technology. We wish a very bright future and success to the shining stars of this institution."
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "OUR SCHOOLS",
        "content": [
          "Why don’t you check out the major you’re interested in?"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "WHY CHOOSE US",
        "content": [
          "We are the best IT University in Pakistan"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "PHOTO GALLERY",
        "content": [
          "Here’s a sneak preview of life at FAST-NU"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "NEWS AND ANNOUNCEMENTS",
        "content": [
          "Recent News and Announcements",
          "The University is looking for experienced and dedicated faculty members in the Departments mentioned below for its Chiniot-Faisalabad campus.",
          "By: HR CFD Campus",
          "No Comments\nApril 8, 2024",
          "No Comments",
          "April 8, 2024",
          "Faculty with a passion for teaching and research are required at CHINIOT-FAISALABAD campus of the University. Applicants should have",
          "By: HR CFD Campus",
          "No Comments\nOctober 23, 2023",
          "No Comments",
          "October 23, 2023",
          "PROJECT TITLE A provable secure attribute-based generalized proxy signcryption scheme with incremental cryptography for IoT enabled e-healthcare. ELIGIBILITY MS Computer",
          "By: HR CFD Campus",
          "No Comments\nSeptember 4, 2023",
          "No Comments",
          "September 4, 2023"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "UPCOMING EVENTS",
        "content": [
          "Have a look at upcoming events",
          "Commencement of Classes",
          "19",
          "AUG",
          "ICIT 2024",
          "10",
          "DEC"
        ],
        "lists": [],
        "tables": []
      },
      {
        "type": "section",
        "heading": "CAMPUS HIGHLIGHTS",
        "content": [
          "Here’s sneak preview of life at FAST-NU"
        ],
        "lists": [],
        "tables": []
      }
    ]
  }
]